# Pandas Assignment

In [103]:
#importing the necessary libraries
import pandas as pd
import numpy as np

In [104]:
# Creating the dataframe
df = pd.DataFrame({'From_to':['LoNDon_paris','MAdrid_MiLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                  'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                  'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                  'Airline':['KLM(!)','<AirFrance>(12)','(British Airways. )','12.Air France','"Swiss Air"']})

In [105]:
df

            From_to  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_MiLAN           NaN            []      <AirFrance>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Question 1

In [106]:
#Question 1 - adding missing values in FLight column and chaging its type from into to float

df['FlightNumber'][1] = 10055.0
df['FlightNumber'][3] = 10075.0

df

C:\Users\thamatak\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\thamatak\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

            From_to  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_MiLAN       10055.0            []      <AirFrance>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [107]:
#Q No:1 convert FightNumber column from float to int

df['FlightNumber'] = df.FlightNumber.astype(int)

df.dtypes

From_to         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

# Question 2

In [108]:
#QNo:2 Creating temporary DataFrame with From and To columns
split_data = df['From_to'].str.split('_')
split_data = split_data.to_list()
names = ["From","To"]
temp = pd.DataFrame(split_data,columns=names)
temp

       From         To
0    LoNDon      paris
1    MAdrid      MiLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# Question 3

In [109]:
# QNo:3 First letter of city to upper case
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()

In [110]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Question 4

In [111]:
#QNo: 4 deleting from_to from original dataframe and attaching to temp dataframe
df.drop('From_to',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []      <AirFrance>(12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]        12.Air France
4         10085      [67, 32]          "Swiss Air"

In [112]:
#QNo: 4 deleting from_to from original dataframe and attaching to temp dataframe
temp = temp.join(df)
temp

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []      <AirFrance>(12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]        12.Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

# Question Number 5

In [134]:
#QNo:5 Splitting RecentDelays into values and creating separate columns
delays_splitted = temp.RecentDelays
delays_splitted = delays_splitted.to_list()
type(delays_splitted)

list

In [144]:
delays = pd.DataFrame(delays_splitted)
delays

delays.rename(columns = {0:"delay_1",1:"delay_2",2:"delay_3"} , inplace=True)
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [147]:
temp = temp.join(delays)

In [149]:
temp.drop('RecentDelays',axis=1,inplace=True)

In [150]:
temp

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<AirFrance>(12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12.Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN